TRIAL_ERROR_TEXT = (
    "<b>Ошибка!</b> Вы уже использовали пробную подписку!\n"
    "Приобрести подписку можно в личном кабинете."
)

TRIAL_SUCCESS_TEXT = (
    "<b>Поздравляю!</b> Пробная подписка на 3 дня активирована.\n"
    "После её окончания вы сможете приобрести новую в личном кабинете."
)

ERROR_TECH_TEXT = "Извините, произошла техническая ошибка. Попробуйте позже."

MENU_TRIAL_TEXT = (
    "Вы можете активировать пробную подписку, что бы опробовать наш сервис.\n\n"
    "После её окончания вы сможете приобрести новую в личном кабинете.\n\n"
)

NEW_USER_TEXT = (
    "Вас пригласил пользователь: {referrer_id}!\n\n"
    "Поздравляем, вы получаете дополнительные 7 дней пробной подписки\n"
)

REFERRAL_HANDLER_TEXT = (
    "<b>Реферальная система:</b>\n"
    "Приглашайте друзей и получайте бонусы!\n\n"
    "Приглашено рефералов: {count_ref}\n"
    "Заработано с рефералов: {reward_balance}\n\n"
    "<b>Ваша реферальная ссылка:</b>\n"
    "<code>{link}</code>"
)

PAYMENT_SUCCESS_TEXT = "Подписка {tariff} успешно активирована/продлена на {day} дней!"

PAYMENT_FAILED_TEXT = "Произошла ошибка при связи с сервером VPN. Свяжитесь с поддержкой."

ADD_REWARD_TEXT = "💰 Один из ваших рефералов приобрел подписку, вам было начислено {reward_amount} ₽"