TRIAL_ERROR_TEXT = (
    "<b>Ошибка!</b> Вы уже использовали пробную подписку!\n"
    "Приобрести подписку можно в личном кабинете."
)

TRIAL_SUCCESS_TEXT = (
    "<b>Поздравляю!</b> Пробная подписка на 3 дня активирована.\n"
    "После её окончания вы сможете приобрести новую в личном кабинете."
)

ERROR_TECH_TEXT = "Извините, произошла техническая ошибка. Попробуйте позже."

MENU_TRIAL_TEXT = (
    "Вы можете активировать пробную подписку на 3 дня\n"
    "что бы опробовать наш сервис, после истечения срока\n"
    "просто продлите её в личном кабинете"
)

REFERRAL_HANDLER_TEXT = (
    "<b>Реферальная система:</b>\n"
    "Приглашайте друзей и получайте бонусы!\n\n"
    "Вы пригласили: [add function] человек.\n"
    "Заработано с рефералов: [add function]\n\n"
    "<b>Ваша реферальная ссылка:</b>\n"
    "<code>{link}</code>"
)